"""
Дана строка. Замените в этой строке все цифры 1 на слово one
"""

test_string = input("Введите строку ")
print(test_string.replace('1', 'one'))
