"""
Дано слово. Верно ли, что оно начинается и оканчивается на одну и ту же букву?
"""

word = input("Введите слово ")
print(word[0] == word[-1])
