"""
Дан текст. Слова в тексте разделены одним или несколькими пробелами.
Написать программу определяющую количество слов, заканчивающихся одной и той же буквой ‘f’.
"""

test_string = "fast    first fruit proof "
print(test_string.endswith("f"))

# не нашел решение без использования циклов, могу сделать при  помощи циклов
