"""
Дана строка “*”. Получить строку, состоящую из пяти звездочек (символов "*").
"""
string = "*"
print(string * 5)
