"""
6) Напишите программу, которая вычисляет сколько полных недель прошло за период, если прошло 182 дня.
"""

days = 182
weeks = days // 7
print(f"За {days} дней прошло {weeks} полных недель.")
