"""
Вывести на экран число "10" 20 раз столбиком
"""
for number in range(21):
    print(f'{number}. 10')
