"""
Выведите на экран в одну строку числа от 100 до -100 включительно.
"""

for number in range(-100, 101):
    print(f'{number}', end=' ')
